# Задача 1.Сформуйте строку, яка містить певну інформацію про символ по його індексу в відомому слові.
# Наприклад "The [індекс символу] symbol in [тут слово] is '[символ з відповідним порядковим номером]'".
# Слово та номер отримайте за допомогою input() або скористайтеся константою.
# Наприклад (слово - "Python" а номер символу 3) - "The 3 symbol in "Python" is 't' ".

word = input('Введіть слово:')
number = int(input('Введіть номер символа:'))
result = word[number - 1]
print('The', number, 'symbol in', '"' + word + '"', 'is', "'" + result + "'", end='.')

# Задача 2. Ввести з консолі строку зі слів за допомогою input() (або скористайтеся константою).
# Напишіть код, який визначить кількість слів, в цих даних.

some_text = input('Введіть дані:')
result = len(some_text.split())
print('Кількість слів в цих даних складає:', result)

# Задача 3.Існує ліст з різними даними,
# наприклад lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum'].
# Напишіть код, який сфлрмує новий list (наприклад lst2), який би містив всі числові змінні (int, float), які є в lst1.
# Майте на увазі, що данні в lst1 не є статичними можуть змінюватись від запуску до запуску.

list1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum']
list2 = []
for elements in list1:
    if type(elements) is int or type(elements) is float:
        list2.append(elements)
print(list2)